symbolic-integration-1-transcendental-functions-2.org
#+BEGIN_SRC axiom :results none
)set message prompt plain
)boot $IOindex := nil
#+END_SRC

* 2 Integration of Rational Functions
The algorithms and theorems of this chapter are special cases of the
Risch algorithm.

** Introduction
The problem of computing the transcendental part of the integral
without factoring remained open for over a century, and was finally
solved in recent papers [56, [[cite:rothstein1977new][83]], 89].

** 2.1 The Bernoulli Algorithm
*** Example 2.1.1
#+BEGIN_SRC axiom
)expose INTRAT
F ==> FRAC INT; UUP ==> UP(x, F); FFR ==> FRAC UUP;
f : FFR := 1/(x^3+x)

partialFraction f

integrate univariate(f, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> )expose INTRAT
   RationalIntegration is already explicitly exposed in frame initial
-> F ==> FRAC INT; UUP ==> UP(x, F); FFR ==> FRAC UUP;
                                                                    Type: Void
-> f : FFR := 1/(x^3+x)

      1
   ──────
    3
   x  + x
                    Type: Fraction(UnivariatePolynomial(x,Fraction(Integer)))
-> partialFraction f

   1      x
   ─ - ──────
   x    2
       x  + 1
             Type: PartialFraction(UnivariatePolynomial(x,Fraction(Integer)))
-> integrate univariate(f, x)

     1      2
   - ─ log(?  + 1) + log(?)
     2
Type: IntegrationResult(Fraction(SparseUnivariatePolynomial(Fraction(Polynomial(Fraction(Integer))))))

#+end_example

*** Example 2.1.2
#+BEGIN_SRC axiom
f := 1/(x^2+1)^2;

partialFraction f

integrate(f::EXPR INT, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> f := 1/(x^2+1)^2;

                    Type: Fraction(UnivariatePolynomial(x,Fraction(Integer)))
-> partialFraction f

       1
   ─────────
     2     2
   (x  + 1)
             Type: PartialFraction(UnivariatePolynomial(x,Fraction(Integer)))
-> integrate(f::EXPR INT, x)

     2
   (x  + 1)atan(x) + x
   ───────────────────
            2
         2 x  + 2
                                         Type: Union(Expression(Integer),...)

#+end_example

*** Example 2.1.3
#+BEGIN_SRC axiom
f1 : FRAC UP(y, FRAC COMPLEX INT) := 1/(y^3+y)

partialFraction f1

reduce(+, map(integrate, fractionalTerms %))
#+END_SRC

#+RESULTS:
#+begin_example
-> f1 : FRAC UP(y, FRAC COMPLEX INT) := 1/(y^3+y)

      1
   ──────
    3
   y  + y
           Type: Fraction(UnivariatePolynomial(y,Fraction(Complex(Integer))))
-> partialFraction f1

        1        1
        ─        ─
        2        2     1
   - ────── - ────── + ─
     y - %i   y + %i   y
    Type: PartialFraction(UnivariatePolynomial(y,Fraction(Complex(Integer))))
-> reduce(+, map(integrate, fractionalTerms %))

            1               1
   log(y) - ─ log(y + %i) - ─ log(y - %i)
            2               2
Type: IntegrationResult(Fraction(UnivariatePolynomial(y,Fraction(Complex(Integer)))))

#+end_example

An algorithm that never makes an unnecessary algebraic extension and
does not compute irreducible factorizations over K will be called
"rational".

** 2.2 The Hermite Reduction
*** Example 2.2.1 HermiteIntegrate
#+BEGIN_SRC axiom
f := (x^7 - 24*x^4 - 4*x^2 + 8*x - 8)/(x^8 + 6*x^6 + 12*x^4 + 8*x^2);

squareFree denom f

partialFraction f

HermiteIntegrate(f, differentiate)$INTHERTR(F, UUP)
-- Or ')expose TranscendentalHermiteIntegration' and the '$'
-- selector can be omitted.

integrate univariate(f, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> f := (x^7 - 24*x^4 - 4*x^2 + 8*x - 8)/(x^8 + 6*x^6 + 12*x^4 + 8*x^2);

                    Type: Fraction(UnivariatePolynomial(x,Fraction(Integer)))
-> squareFree denom f

    2  2     3
   x (x  + 2)
                    Type: Factored(UnivariatePolynomial(x,Fraction(Integer)))
-> partialFraction f

            4      3       2
   x - 1   x  - 6 x  - 18 x  - 12 x + 8
   ───── + ────────────────────────────
      2                2     3
     x               (x  + 2)
             Type: PartialFraction(UnivariatePolynomial(x,Fraction(Integer)))
-> HermiteIntegrate(f, differentiate)$INTHERTR(F, UUP)

                3      2
             3 x  + 8 x  + 6 x + 4            1
   [answer = ─────────────────────, logpart = ─, specpart = 0, polypart = 0]
                 5      3                     x
                x  + 4 x  + 4 x
Type: Record(answer: Fraction(UnivariatePolynomial(x,Fraction(Integer))),logpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),specpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),polypart: UnivariatePolynomial(x,Fraction(Integer)))
-> -- Or ')expose TranscendentalHermiteIntegration' and the '$'
-> -- selector can be omitted.
-> integrate univariate(f, x)

      3      2
   3 ?  + 8 ?  + 6 ? + 4
   ───────────────────── + log(?)
       5      3
      ?  + 4 ?  + 4 ?
Type: IntegrationResult(Fraction(SparseUnivariatePolynomial(Fraction(Polynomial(Fraction(Integer))))))

#+end_example

*** Example 2.2.2
