symbolic-integration-1-transcendental-functions-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-25 Thu 17:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge1b9e77">1. 2 Integration of Rational Functions</a>
<ul>
<li><a href="#org867c2a4">1.1. Introduction</a></li>
<li><a href="#orge38f16b">1.2. 2.1 The Bernoulli Algorithm</a>
<ul>
<li><a href="#org19ebde3">1.2.1. Example 2.1.1</a></li>
<li><a href="#orgcb31be7">1.2.2. Example 2.1.2</a></li>
<li><a href="#org82ce44a">1.2.3. Example 2.1.3</a></li>
</ul>
</li>
<li><a href="#orgd3e6220">1.3. 2.2 The Hermite Reduction</a>
<ul>
<li><a href="#org8ec0359">1.3.1. Example 2.2.1 HermiteIntegrate</a></li>
<li><a href="#org11d2118">1.3.2. Example 2.2.2</a></li>
<li><a href="#org1878c40">1.3.3. Algorithm: HermiteReduce(A, D) (* Hermite Reduction &#x2013; Mack's linear version *)</a></li>
<li><a href="#orgda6527a">1.3.4. Example 2.2.3</a></li>
</ul>
</li>
<li><a href="#org6cdeef1">1.4. 2.3 The Horowitz-Ostrogradsky Algorithm</a></li>
<li><a href="#orgc9655d4">1.5. 2.4 The Rothstein-Trager Algorithm</a>
<ul>
<li><a href="#org3f8dc08">1.5.1. Algorithm: IntRationalLogPart(A, D) (* Rothstein-Trager algorithm *)</a></li>
<li><a href="#org8a6dd52">1.5.2. Example 2.4.1</a></li>
</ul>
</li>
<li><a href="#org4447ac2">1.6. 2.5 The Lazard-Rioboo-Trager Algorithm</a>
<ul>
<li><a href="#orgcc8f349">1.6.1. Algorithm: IntRationalLogPart(A, D) (* Lazard-Rioboo-Trager algorithm *)</a></li>
<li><a href="#org64606f8">1.6.2. Example 2.5.1</a></li>
<li><a href="#org71b9327">1.6.3. Example 2.5.2</a></li>
</ul>
</li>
<li><a href="#org697109f">1.7. 2.6 The Czichowski Algorithm</a>
<ul>
<li><a href="#orge54e2ba">1.7.1. Example 2.6.1</a></li>
</ul>
</li>
<li><a href="#orgada3789">1.8. 2.7 Newton-Leibniz-Bernoulli Revisited</a>
<ul>
<li><a href="#org9b34b8e">1.8.1. Example 2.7.1</a></li>
<li><a href="#org09b286f">1.8.2. Example 2.7.2</a></li>
<li><a href="#orgc7665f5">1.8.3. Example 2.7.3</a></li>
</ul>
</li>
<li><a href="#org35be5e8">1.9. 2.8 Rioboo's Algorithm for Real Rational Functions</a>
<ul>
<li><a href="#org31914f6">1.9.1. Algorithm: LogToAtan(A, B)</a></li>
<li><a href="#org5d36644">1.9.2. Example 2.8.1</a></li>
</ul>
</li>
<li><a href="#org376c91d">1.10. 2.9 In-Field Integration</a></li>
<li><a href="#orgc13c8df">1.11. Exercises</a>
<ul>
<li><a href="#org5488a99">1.11.1. Exercise 2.1</a></li>
<li><a href="#org7e6a8c9">1.11.2. Exercise 2.2</a></li>
<li><a href="#org87fc506">1.11.3. Exercise 2.3</a></li>
<li><a href="#orgb5a2fda">1.11.4. Exercise 2.4</a></li>
<li><a href="#orgba1bff9">1.11.5. Exercise 2.5</a></li>
<li><a href="#org7030c20">1.11.6. Exercise 2.7</a></li>
<li><a href="#orga79ec96">1.11.7. Exercise 2.8</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-src-container">
<pre class="src src-axiom">)set message prompt plain
)boot $IOindex := nil
</pre>
</div>

<div id="outline-container-orge1b9e77" class="outline-2">
<h2 id="orge1b9e77"><span class="section-number-2">1</span> 2 Integration of Rational Functions</h2>
<div class="outline-text-2" id="text-1">
<p>
The algorithms and theorems of this chapter are special cases of the
Risch algorithm.
</p>
</div>

<div id="outline-container-org867c2a4" class="outline-3">
<h3 id="org867c2a4"><span class="section-number-3">1.1</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The problem of computing the transcendental part of the integral
without factoring remained open for over a century, and was finally
solved in recent papers [56, <a class='org-ref-reference' href="#rothstein1977new">rothstein1977new</a>, 89].
</p>
</div>
</div>

<div id="outline-container-orge38f16b" class="outline-3">
<h3 id="orge38f16b"><span class="section-number-3">1.2</span> 2.1 The Bernoulli Algorithm</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org19ebde3" class="outline-4">
<h4 id="org19ebde3"><span class="section-number-4">1.2.1</span> Example 2.1.1</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-axiom">)expose INTRAT
F ==&gt; FRAC INT; UUP ==&gt; UP(x, F); FFR ==&gt; FRAC UUP;
f : FFR := 1/(x^3+x)

partialFraction f

integrate univariate(f, x)
</pre>
</div>

<pre class="example" id="orge325467">
-&gt; )expose INTRAT
   RationalIntegration is already explicitly exposed in frame initial
-&gt; F ==&gt; FRAC INT; UUP ==&gt; UP(x, F); FFR ==&gt; FRAC UUP;
                                                                    Type: Void
-&gt; f : FFR := 1/(x^3+x)

      1
   ──────
    3
   x  + x
                    Type: Fraction(UnivariatePolynomial(x,Fraction(Integer)))
-&gt; partialFraction f

   1      x
   ─ - ──────
   x    2
       x  + 1
             Type: PartialFraction(UnivariatePolynomial(x,Fraction(Integer)))
-&gt; integrate univariate(f, x)

     1      2
   - ─ log(?  + 1) + log(?)
     2
Type: IntegrationResult(Fraction(SparseUnivariatePolynomial(Fraction(Polynomial(Fraction(Integer))))))

</pre>
</div>
</div>

<div id="outline-container-orgcb31be7" class="outline-4">
<h4 id="orgcb31be7"><span class="section-number-4">1.2.2</span> Example 2.1.2</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-axiom">f := 1/(x^2+1)^2;

partialFraction f

integrate(f::EXPR INT, x)
</pre>
</div>

<pre class="example" id="org5fbe3d4">
-&gt; f := 1/(x^2+1)^2;

                    Type: Fraction(UnivariatePolynomial(x,Fraction(Integer)))
-&gt; partialFraction f

       1
   ─────────
     2     2
   (x  + 1)
             Type: PartialFraction(UnivariatePolynomial(x,Fraction(Integer)))
-&gt; integrate(f::EXPR INT, x)

     2
   (x  + 1)atan(x) + x
   ───────────────────
            2
         2 x  + 2
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>

<div id="outline-container-org82ce44a" class="outline-4">
<h4 id="org82ce44a"><span class="section-number-4">1.2.3</span> Example 2.1.3</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">
<pre class="src src-axiom">f1 : FRAC UP(y, FRAC COMPLEX INT) := 1/(y^3+y)

partialFraction f1

reduce(+, map(integrate, fractionalTerms %))
</pre>
</div>

<pre class="example" id="orgd6ff51d">
-&gt; f1 : FRAC UP(y, FRAC COMPLEX INT) := 1/(y^3+y)

      1
   ──────
    3
   y  + y
           Type: Fraction(UnivariatePolynomial(y,Fraction(Complex(Integer))))
-&gt; partialFraction f1

        1        1
        ─        ─
        2        2     1
   - ────── - ────── + ─
     y - %i   y + %i   y
    Type: PartialFraction(UnivariatePolynomial(y,Fraction(Complex(Integer))))
-&gt; reduce(+, map(integrate, fractionalTerms %))

            1               1
   log(y) - ─ log(y + %i) - ─ log(y - %i)
            2               2
Type: IntegrationResult(Fraction(UnivariatePolynomial(y,Fraction(Complex(Integer)))))

</pre>

<p>
An algorithm that never makes an unnecessary algebraic extension and
does not compute irreducible factorizations over K will be called
"rational".
</p>
</div>
</div>
</div>

<div id="outline-container-orgd3e6220" class="outline-3">
<h3 id="orgd3e6220"><span class="section-number-3">1.3</span> 2.2 The Hermite Reduction</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org8ec0359" class="outline-4">
<h4 id="org8ec0359"><span class="section-number-4">1.3.1</span> Example 2.2.1 HermiteIntegrate</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-axiom">f := (x^7 - 24*x^4 - 4*x^2 + 8*x - 8)/(x^8 + 6*x^6 + 12*x^4 + 8*x^2);

squareFree denom f

partialFraction f

HermiteIntegrate(f, differentiate)$INTHERTR(F, UUP)
-- Or ')expose TranscendentalHermiteIntegration' and the '$'
-- selector can be omitted.

integrate univariate(f, x)
</pre>
</div>

<pre class="example" id="orgab8d08d">
-&gt; f := (x^7 - 24*x^4 - 4*x^2 + 8*x - 8)/(x^8 + 6*x^6 + 12*x^4 + 8*x^2);

                    Type: Fraction(UnivariatePolynomial(x,Fraction(Integer)))
-&gt; squareFree denom f

    2  2     3
   x (x  + 2)
                    Type: Factored(UnivariatePolynomial(x,Fraction(Integer)))
-&gt; partialFraction f

            4      3       2
   x - 1   x  - 6 x  - 18 x  - 12 x + 8
   ───── + ────────────────────────────
      2                2     3
     x               (x  + 2)
             Type: PartialFraction(UnivariatePolynomial(x,Fraction(Integer)))
-&gt; HermiteIntegrate(f, differentiate)$INTHERTR(F, UUP)

                3      2
             3 x  + 8 x  + 6 x + 4            1
   [answer = ─────────────────────, logpart = ─, specpart = 0, polypart = 0]
                 5      3                     x
                x  + 4 x  + 4 x
Type: Record(answer: Fraction(UnivariatePolynomial(x,Fraction(Integer))),logpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),specpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),polypart: UnivariatePolynomial(x,Fraction(Integer)))
-&gt; -- Or ')expose TranscendentalHermiteIntegration' and the '$'
-&gt; -- selector can be omitted.
-&gt; integrate univariate(f, x)

      3      2
   3 ?  + 8 ?  + 6 ? + 4
   ───────────────────── + log(?)
       5      3
      ?  + 4 ?  + 4 ?
Type: IntegrationResult(Fraction(SparseUnivariatePolynomial(Fraction(Polynomial(Fraction(Integer))))))

</pre>
</div>
</div>
