symbolic-integration-1-transcendental-functions-2.org
*** Algorithm: HermiteReduce(A, D) (* Hermite Reduction -- Mack's linear version *)
[[~/github/fricas/src/algebra/intrf.spad::272]]

#+BEGIN_SRC sh :results verbatim :exports both
cd ~/github/fricas
grep -A25 'Hermite Reduction' src/algebra/intrf.spad
#+END_SRC

#+RESULTS:
#+begin_example
-- Hermite Reduction on f, every squarefree factor of denom(f) is normal wrt D
-- this is really a "parallel" Hermite reduction, in the sense that
-- every multiple factor of the denominator gets reduced at each pass
-- so if the denominator is P1 P2^2 ... Pn^n, this requires O(n)
-- reduction steps instead of O(n^2), like Mack's algorithm
-- (D.Mack, On Rational Integration, Univ. of Utah C.S. Tech.Rep. UCP-38, 1975)
-- returns [g, b, d] s.t. f = g' + b/d and d is squarefree and normal wrt D
    normalHermiteIntegrate(f, derivation, d0) ==
      a := numer f
      q := denom f
      p : UP    := 0
      mult : UP := 1
      qhat := (q exquo (g0 := g := gcd(q, differentiate q)))::UP
      while(degree(qbar := g) > 0) repeat
        qbarhat := (qbar exquo (g := gcd(qbar, differentiate qbar)))::UP
        qtil := - ((qhat * (derivation qbar)) exquo qbar)::UP
        bc :=
         extendedEuclidean(qtil, qbarhat, a)::Record(coef1 : UP, coef2 : UP)
        qr := divide(bc.coef1, qbarhat)
        qr_rem := qr.remainder
        a  := bc.coef2 + qtil * qr.quotient - (derivation(qr_rem)
                + d0*qr_rem)*(qhat exquo qbarhat)::UP
        p  := p + mult*qr_rem
        mult := mult * qbarhat
      [p / g0, a, qhat]

#+end_example

We remark that it is possible to perform all the variants of Hermite's
reduction over a UFD rather than a field.

#+BEGIN_ASCII
NOTES BY ME:

FriCAS is over Field.
#+END_ASCII

*** Example 2.2.3
** 2.3 The Horowitz-Ostrogradsky Algorithm
While the complexity of this algorithm is very good for rational
functions [ 45 ], it does not generalize as easily as the Hermite
reduction to larger classes of functions, so we use the linear Hermite
reduction in the general algorithm later.

** 2.4 The Rothstein-Trager Algorithm
With appropriate modifications, the Rothstein-Trager algorithm can, like the
Hermite reduction, be applied to rational functions over a UFD rather than a
field. Part (iii) of Theorem 2.4.1 shows that the splitting field of R is the
minimal algebraic extension of K necessary to express the integral of =A/D=
using logarithms, thereby essentially answering question Q2.

*** Algorithm: IntRationalLogPart(A, D) (* Rothstein-Trager algorithm *)
See bellow Lazard-Rioboo-Trager algorithm.

*** Example 2.4.1
#+BEGIN_SRC axiom
f := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4);
A := numer f; D := denom f;

HermiteIntegrate(f, differentiate)$INTHERTR(F, UUP)

t := monomial(1, 1)$SUP F
T ==> UP(x, SUP F)
factor resultant(D, A - t * differentiate D)$T

a | 4*a^2 + 1 = 0
gcd(D, A - a * differentiate D)

monomialIntegrate(f, differentiate)$INTTR(F, UUP)

integrate(f::EXPR INT, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> f := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4);

                    Type: Fraction(UnivariatePolynomial(x,Fraction(Integer)))
-> A := numer f; D := denom f;

                              Type: UnivariatePolynomial(x,Fraction(Integer))
-> HermiteIntegrate(f, differentiate)$INTHERTR(F, UUP)

                               4      2
                              x  - 3 x  + 6
   [answer = 0, logpart = ────────────────────, specpart = 0, polypart = 0]
                           6      4      2
                          x  - 5 x  + 5 x  + 4
Type: Record(answer: Fraction(UnivariatePolynomial(x,Fraction(Integer))),logpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),specpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),polypart: UnivariatePolynomial(x,Fraction(Integer)))
-> t := monomial(1, 1)$SUP F

   ?
                          Type: SparseUnivariatePolynomial(Fraction(Integer))
-> T ==> UP(x, SUP F)
                                                                    Type: Void
-> factor resultant(D, A - t * differentiate D)$T

             2   1 3
   2930944 (?  + ─)
                 4
                Type: Factored(SparseUnivariatePolynomial(Fraction(Integer)))
-> a | 4*a^2 + 1 = 0
    Your statement has resulted in the following assignments and
      declaration:

   SAEa := SimpleAlgebraicExtension(Fraction(Integer),UnivariatePolynomial(a,Fraction(Integer)),4*a^2+1)
   a : SAEa := a

   a
Type: SimpleAlgebraicExtension(Fraction(Integer),UnivariatePolynomial(a,Fraction(Integer)),4*a^2+1)
-> gcd(D, A - a * differentiate D)

    3        2
   x  + 2 a x  - 3 x - 4 a
Type: UnivariatePolynomial(x,SimpleAlgebraicExtension(Fraction(Integer),UnivariatePolynomial(a,Fraction(Integer)),4*a^2+1))
-> monomialIntegrate(f, differentiate)$INTTR(F, UUP)

             ──┐                 2           3
   [ir =     >        %M log((2 x  - 4)%M + x  - 3 x), specpart = 0,
             ──┘
           2   1
         %M  + ─ = 0
               4
    polypart = 0]
Type: Record(ir: IntegrationResult(Fraction(UnivariatePolynomial(x,Fraction(Integer)))),specpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),polypart: UnivariatePolynomial(x,Fraction(Integer)))
-> integrate(f::EXPR INT, x)

         5      3
        x  - 3 x  + x          3
   atan(─────────────) + atan(x ) + atan(x)
              2
                                         Type: Union(Expression(Integer),...)

#+end_example

** 2.5 The Lazard-Rioboo-Trager Algorithm
#+BEGIN_ASCII
NOTES BY ME:

Renaud Rioboo is also the author of several AXIOM packages.
#+END_ASCII

Although he did not publish it, Trager programmed this algorithm in
his AXIOM implementation of rational function integration.

As long as the result is returned as a formal sum over the roots of some
polynomials, all the calculations are done over K, no algebraic extensions is
required, and the formal algebraic numbers introduced by the sum are in the
smallest possible algebraic extension needed to express the integral.

