symbolic-integration-1-transcendental-functions-2.html

<div id="outline-container-org11d2118" class="outline-4">
<h4 id="org11d2118"><span class="section-number-4">1.3.2</span> Example 2.2.2</h4>
</div>
<div id="outline-container-org1878c40" class="outline-4">
<h4 id="org1878c40"><span class="section-number-4">1.3.3</span> Algorithm: HermiteReduce(A, D) (* Hermite Reduction &#x2013; Mack's linear version *)</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
<a href="file:///fricas/src/algebra/intrf.spad">file:///fricas/src/algebra/intrf.spad</a> 272
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> /fricas
grep -A25 <span style="color: #2d9574;">'Hermite Reduction'</span> src/algebra/intrf.spad
</pre>
</div>

<pre class="example" id="orgd7c3c8e">
-- Hermite Reduction on f, every squarefree factor of denom(f) is normal wrt D
-- this is really a "parallel" Hermite reduction, in the sense that
-- every multiple factor of the denominator gets reduced at each pass
-- so if the denominator is P1 P2^2 ... Pn^n, this requires O(n)
-- reduction steps instead of O(n^2), like Mack's algorithm
-- (D.Mack, On Rational Integration, Univ. of Utah C.S. Tech.Rep. UCP-38, 1975)
-- returns [g, b, d] s.t. f = g' + b/d and d is squarefree and normal wrt D
    normalHermiteIntegrate(f, derivation, d0) ==
      a := numer f
      q := denom f
      p : UP    := 0
      mult : UP := 1
      qhat := (q exquo (g0 := g := gcd(q, differentiate q)))::UP
      while(degree(qbar := g) &gt; 0) repeat
        qbarhat := (qbar exquo (g := gcd(qbar, differentiate qbar)))::UP
        qtil := - ((qhat * (derivation qbar)) exquo qbar)::UP
        bc :=
         extendedEuclidean(qtil, qbarhat, a)::Record(coef1 : UP, coef2 : UP)
        qr := divide(bc.coef1, qbarhat)
        qr_rem := qr.remainder
        a  := bc.coef2 + qtil * qr.quotient - (derivation(qr_rem)
                + d0*qr_rem)*(qhat exquo qbarhat)::UP
        p  := p + mult*qr_rem
        mult := mult * qbarhat
      [p / g0, a, qhat]

</pre>

<p>
We remark that it is possible to perform all the variants of Hermite's
reduction over a UFD rather than a field.
</p>

<div class="ASCII" id="org43e2440">
<p>
NOTES BY ME:
</p>

<p>
FriCAS is over Field.
</p>

</div>
</div>
</div>

<div id="outline-container-orgda6527a" class="outline-4">
<h4 id="orgda6527a"><span class="section-number-4">1.3.4</span> Example 2.2.3</h4>
</div>
</div>
<div id="outline-container-org6cdeef1" class="outline-3">
<h3 id="org6cdeef1"><span class="section-number-3">1.4</span> 2.3 The Horowitz-Ostrogradsky Algorithm</h3>
<div class="outline-text-3" id="text-1-4">
<p>
While the complexity of this algorithm is very good for rational
functions [ 45 ], it does not generalize as easily as the Hermite
reduction to larger classes of functions, so we use the linear Hermite
reduction in the general algorithm later.
</p>
</div>
</div>

<div id="outline-container-orgc9655d4" class="outline-3">
<h3 id="orgc9655d4"><span class="section-number-3">1.5</span> 2.4 The Rothstein-Trager Algorithm</h3>
<div class="outline-text-3" id="text-1-5">
<p>
With appropriate modifications, the Rothstein-Trager algorithm can, like the
Hermite reduction, be applied to rational functions over a UFD rather than a
field. Part (iii) of Theorem 2.4.1 shows that the splitting field of R is the
minimal algebraic extension of K necessary to express the integral of <code>A/D</code>
using logarithms, thereby essentially answering question Q2.
</p>
</div>

<div id="outline-container-org3f8dc08" class="outline-4">
<h4 id="org3f8dc08"><span class="section-number-4">1.5.1</span> Algorithm: IntRationalLogPart(A, D) (* Rothstein-Trager algorithm *)</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
See bellow Lazard-Rioboo-Trager algorithm.
</p>
</div>
</div>

<div id="outline-container-org8a6dd52" class="outline-4">
<h4 id="org8a6dd52"><span class="section-number-4">1.5.2</span> Example 2.4.1</h4>
<div class="outline-text-4" id="text-1-5-2">
<div class="org-src-container">
<pre class="src src-axiom">f := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4);
A := numer f; D := denom f;

HermiteIntegrate(f, differentiate)$INTHERTR(F, UUP)

t := monomial(1, 1)$SUP F
T ==&gt; UP(x, SUP F)
factor resultant(D, A - t * differentiate D)$T

a | 4*a^2 + 1 = 0
gcd(D, A - a * differentiate D)

monomialIntegrate(f, differentiate)$INTTR(F, UUP)

integrate(f::EXPR INT, x)
</pre>
</div>

<pre class="example" id="orgc84b6ce">
-&gt; f := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4);

                    Type: Fraction(UnivariatePolynomial(x,Fraction(Integer)))
-&gt; A := numer f; D := denom f;

                              Type: UnivariatePolynomial(x,Fraction(Integer))
-&gt; HermiteIntegrate(f, differentiate)$INTHERTR(F, UUP)

                               4      2
                              x  - 3 x  + 6
   [answer = 0, logpart = ────────────────────, specpart = 0, polypart = 0]
                           6      4      2
                          x  - 5 x  + 5 x  + 4
Type: Record(answer: Fraction(UnivariatePolynomial(x,Fraction(Integer))),logpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),specpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),polypart: UnivariatePolynomial(x,Fraction(Integer)))
-&gt; t := monomial(1, 1)$SUP F

   ?
                          Type: SparseUnivariatePolynomial(Fraction(Integer))
-&gt; T ==&gt; UP(x, SUP F)
                                                                    Type: Void
-&gt; factor resultant(D, A - t * differentiate D)$T

             2   1 3
   2930944 (?  + ─)
                 4
                Type: Factored(SparseUnivariatePolynomial(Fraction(Integer)))
-&gt; a | 4*a^2 + 1 = 0
    Your statement has resulted in the following assignments and
      declaration:

   SAEa := SimpleAlgebraicExtension(Fraction(Integer),UnivariatePolynomial(a,Fraction(Integer)),4*a^2+1)
   a : SAEa := a

   a
Type: SimpleAlgebraicExtension(Fraction(Integer),UnivariatePolynomial(a,Fraction(Integer)),4*a^2+1)
-&gt; gcd(D, A - a * differentiate D)

    3        2
   x  + 2 a x  - 3 x - 4 a
Type: UnivariatePolynomial(x,SimpleAlgebraicExtension(Fraction(Integer),UnivariatePolynomial(a,Fraction(Integer)),4*a^2+1))
-&gt; monomialIntegrate(f, differentiate)$INTTR(F, UUP)

             ──┐                 2           3
   [ir =     &gt;        %M log((2 x  - 4)%M + x  - 3 x), specpart = 0,
             ──┘
           2   1
         %M  + ─ = 0
               4
    polypart = 0]
Type: Record(ir: IntegrationResult(Fraction(UnivariatePolynomial(x,Fraction(Integer)))),specpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),polypart: UnivariatePolynomial(x,Fraction(Integer)))
-&gt; integrate(f::EXPR INT, x)

         5      3
        x  - 3 x  + x          3
   atan(─────────────) + atan(x ) + atan(x)
              2
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org4447ac2" class="outline-3">
<h3 id="org4447ac2"><span class="section-number-3">1.6</span> 2.5 The Lazard-Rioboo-Trager Algorithm</h3>
<div class="outline-text-3" id="text-1-6">
<div class="ASCII" id="org3d216d9">
<p>
NOTES BY ME:
</p>

<p>
Renaud Rioboo is also the author of several AXIOM packages.
</p>

</div>

<p>
Although he did not publish it, Trager programmed this algorithm in
his AXIOM implementation of rational function integration.
</p>

<p>
As long as the result is returned as a formal sum over the roots of some
polynomials, all the calculations are done over K, no algebraic extensions is
required, and the formal algebraic numbers introduced by the sum are in the
smallest possible algebraic extension needed to express the integral.
</p>
</div>
