symbolic-integration-1-transcendental-functions-2.org
*** Algorithm: IntRationalLogPart(A, D) (* Lazard-Rioboo-Trager algorithm *)
[[~/github/fricas/src/algebra/intrf.spad::405]]

#+BEGIN_SRC sh :results verbatim
cd ~/github/fricas
grep -A29 -B1 '  monomialIntegrate1(f : RF' src/algebra/intrf.spad
#+END_SRC

#+RESULTS:
#+begin_example
-- works in any monomial extension
    monomialIntegrate1(f : RF, denint : RF -> DREC, derivation : UP -> UP
                      ) : REC ==
      zero? f => [0, 0, 0]
      r := HermiteIntegrate(f, derivation)
      zero?(numer(r.logpart)) => [r.answer::IR, r.specpart, r.polypart]
      dr := denint(r.logpart)
      ans1 := r.answer + dr.answer
      inum := numer(dr.logpart)
      iden  := denom(dr.logpart)
      x := monomial(1, 1)$UP
      resultvec := subresultantVector(UP2UP2 inum -
                                 (x::UP2) * UP2UP2 derivation iden, UP2UP2 iden)
      respoly := primitivePart leadingCoefficient resultvec 0
      rec := splitSquarefree(respoly, x1+->kappa(x1, derivation))
      logs : List(LOG) := [
              [1, UP2UPR(term.factor),
               UP22UPR swap primitivePart(resultvec(term.exponent), term.factor)]
                     for term in factors(rec.special)]
      dlog :=
--           one? derivation x => dr.logpart
           ((derivation x) = 1) => dr.logpart
           differentiate(mkAnswer(0, logs, empty()),
                         (x1 : RF) : RF+->differentiate(x1, derivation))
      (u := retractIfCan(p := dr.logpart - dlog)@Union(UP, "failed")) case UP =>
        [mkAnswer(ans1, logs, empty) + dr.ir, r.specpart, r.polypart + u::UP]
      [mkAnswer(ans1, logs, [[p, dummy]]) + dr.ir, r.specpart, r.polypart]

    monomialIntegrate(f, derivation) ==
        monomialIntegrate1(f, denint_dummy, derivation)

#+end_example

*** Example 2.5.1
#+BEGIN_SRC axiom
)expose SubResultantPackage
subresultantVector(D::T, (A - t * differentiate D)::T)
#+END_SRC

#+RESULTS:
#+begin_example
-> )expose SubResultantPackage
   SubResultantPackage is already explicitly exposed in frame initial
-> subresultantVector(D::T, (A - t * differentiate D)::T)

            6           4          2
   [2930944?  + 2198208?  + 549552?  + 45796,
              5         3                   4         2
    (- 119840?  - 59920?  - 7490?)x - 23968?  - 11984?  - 1498,
             4        2       2         4        2
    (- 11200?  - 2604?  + 49)x  + 25600?  + 5952?  - 112,
         3        3          2      2           3               2
    (800?  - 14?)x  + (- 400?  + 7)x  + (- 2440?  + 32?)x + 792?  - 16,
          2      4       3        2      2               2
    (- 60?  + 1)x  + 2? x  + (120?  - 3)x  + 26? x + 144?  + 6,
          5    4        3     2               6     4     2
    - 6? x  + x  + 20? x  - 3x  - 10? x + 6, x  - 5x  + 5x  + 4, 0]
Type: PrimitiveArray(UnivariatePolynomial(x,SparseUnivariatePolynomial(Fraction(Integer))))

#+end_example

*** Example 2.5.2
#+BEGIN_SRC axiom
f := 36/(x^5 - 2*x^4 - 2*x^3 + 4*x^2 + x - 2);

HermiteIntegrate(f, differentiate)$INTHERTR(F, UUP)

monomialIntegrate(f, differentiate)$INTTR(F, UUP)

integrate univariate(f, x)

integrate(f::EXPR INT, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> f := 36/(x^5 - 2*x^4 - 2*x^3 + 4*x^2 + x - 2);

                    Type: Fraction(UnivariatePolynomial(x,Fraction(Integer)))
-> HermiteIntegrate(f, differentiate)$INTHERTR(F, UUP)

             12x + 6               12
   [answer = ───────,logpart = ──────────,specpart = 0,polypart = 0]
               2                2
              x  - 1           x  - x - 2
Type: Record(answer: Fraction(UnivariatePolynomial(x,Fraction(Integer))),logpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),specpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),polypart: UnivariatePolynomial(x,Fraction(Integer)))
-> monomialIntegrate(f, differentiate)$INTTR(F, UUP)

         12x + 6       ──┐                3          1
   [ir = ─────── +     >         %R log(- ─ %R + x - ─), specpart = 0,
           2           ──┘                8          2
          x  - 1     2
                   %R  - 16 = 0
    polypart = 0]
Type: Record(ir: IntegrationResult(Fraction(UnivariatePolynomial(x,Fraction(Integer)))),specpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),polypart: UnivariatePolynomial(x,Fraction(Integer)))
-> integrate univariate(f, x)

   12? + 6       ──┐                3          1
   ─────── +     >         %A log(- ─ %A + ? - ─)
     2           ──┘                8          2
    ?  - 1     2
             %A  - 16 = 0
Type: IntegrationResult(Fraction(SparseUnivariatePolynomial(Fraction(Polynomial(Fraction(Integer))))))
-> integrate(f::EXPR INT, x)

        2                     2
   (- 4x  + 4)log(x + 1) + (4x  - 4)log(x - 2) + 12x + 6
   ─────────────────────────────────────────────────────
                            2
                           x  - 1
                                         Type: Union(Expression(Integer),...)

#+end_example

** 2.6 The Czichowski Algorithm
*** Example 2.6.1
#+BEGIN_SRC axiom
)clear all
f := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4);
A := numer f; D := denom f;

groebnerFactorize [D, A - t*differentiate D]
#+END_SRC

#+RESULTS:
#+begin_example
-> )clear all
   All user variables and function definitions have been cleared.
-> f := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4);

                                          Type: Fraction(Polynomial(Integer))
-> A := numer f; D := denom f;

                                                    Type: Polynomial(Integer)
-> groebnerFactorize [D, A - t*differentiate D]

          3       2             2
   [[1],[x  + 2t x  - 3x - 4t,4t  + 1]]
                                        Type: List(List(Polynomial(Integer)))

#+end_example

** 2.7 Newton-Leibniz-Bernoulli Revisited
*** Example 2.7.1
#+BEGIN_SRC axiom
f := 36/(x-2)/(x^2-1)^2
#+END_SRC

#+RESULTS:
: -> f := 36/(x-2)/(x^2-1)^2
:
:                 36
:    ────────────────────────────
:     5     4     3     2
:    x  - 2x  - 2x  + 4x  + x - 2
:                                           Type: Fraction(Polynomial(Integer))
:

*** Example 2.7.2
#+BEGIN_SRC axiom
f1 := univariate(f, x)::FRAC SUP FRAC INT;
fullPartialFraction f1
#+END_SRC

#+RESULTS:
#+begin_example
-> f1 := univariate(f, x)::FRAC SUP FRAC INT;

                Type: Fraction(SparseUnivariatePolynomial(Fraction(Integer)))
-> fullPartialFraction f1

     4       4         ──┐      - 3%I - 6
   ───── - ───── +     >        ─────────
   ? - 2   ? + 1       ──┘              2
                     2          (? - %I)
                   %I  - 1 = 0
Type: FullPartialFractionExpansion(Fraction(Integer),SparseUnivariatePolynomial(Fraction(Integer)))

#+end_example

*** Example 2.7.3
#+BEGIN_SRC axiom
integrate(f, x)
#+END_SRC

#+RESULTS:
: -> integrate(f, x)
:
:         2                     2
:    (- 4x  + 4)log(x + 1) + (4x  - 4)log(x - 2) + 12x + 6
:    ─────────────────────────────────────────────────────
:                             2
:                            x  - 1
:                                          Type: Union(Expression(Integer),...)
:

