symbolic-integration-1-transcendental-functions-2.html

<div id="outline-container-orgcc8f349" class="outline-4">
<h4 id="orgcc8f349"><span class="section-number-4">1.6.1</span> Algorithm: IntRationalLogPart(A, D) (* Lazard-Rioboo-Trager algorithm *)</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
<a href="file:///fricas/src/algebra/intrf.spad">file:///fricas/src/algebra/intrf.spad</a> 405
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> /fricas
grep -A29 -B1 <span style="color: #2d9574;">'  monomialIntegrate1(f : RF'</span> src/algebra/intrf.spad
</pre>
</div>

<pre class="example" id="org4226e5d">
-- works in any monomial extension
    monomialIntegrate1(f : RF, denint : RF -&gt; DREC, derivation : UP -&gt; UP
                      ) : REC ==
      zero? f =&gt; [0, 0, 0]
      r := HermiteIntegrate(f, derivation)
      zero?(numer(r.logpart)) =&gt; [r.answer::IR, r.specpart, r.polypart]
      dr := denint(r.logpart)
      ans1 := r.answer + dr.answer
      inum := numer(dr.logpart)
      iden  := denom(dr.logpart)
      x := monomial(1, 1)$UP
      resultvec := subresultantVector(UP2UP2 inum -
                                 (x::UP2) * UP2UP2 derivation iden, UP2UP2 iden)
      respoly := primitivePart leadingCoefficient resultvec 0
      rec := splitSquarefree(respoly, x1+-&gt;kappa(x1, derivation))
      logs : List(LOG) := [
              [1, UP2UPR(term.factor),
               UP22UPR swap primitivePart(resultvec(term.exponent), term.factor)]
                     for term in factors(rec.special)]
      dlog :=
--           one? derivation x =&gt; dr.logpart
           ((derivation x) = 1) =&gt; dr.logpart
           differentiate(mkAnswer(0, logs, empty()),
                         (x1 : RF) : RF+-&gt;differentiate(x1, derivation))
      (u := retractIfCan(p := dr.logpart - dlog)@Union(UP, "failed")) case UP =&gt;
        [mkAnswer(ans1, logs, empty) + dr.ir, r.specpart, r.polypart + u::UP]
      [mkAnswer(ans1, logs, [[p, dummy]]) + dr.ir, r.specpart, r.polypart]

    monomialIntegrate(f, derivation) ==
        monomialIntegrate1(f, denint_dummy, derivation)

</pre>
</div>
</div>

<div id="outline-container-org64606f8" class="outline-4">
<h4 id="org64606f8"><span class="section-number-4">1.6.2</span> Example 2.5.1</h4>
<div class="outline-text-4" id="text-1-6-2">
<div class="org-src-container">
<pre class="src src-axiom">)expose SubResultantPackage
subresultantVector(D::T, (A - t * differentiate D)::T)
</pre>
</div>

<pre class="example" id="orgad0d935">
-&gt; )expose SubResultantPackage
   SubResultantPackage is already explicitly exposed in frame initial
-&gt; subresultantVector(D::T, (A - t * differentiate D)::T)

            6           4          2
   [2930944?  + 2198208?  + 549552?  + 45796,
              5         3                   4         2
    (- 119840?  - 59920?  - 7490?)x - 23968?  - 11984?  - 1498,
             4        2       2         4        2
    (- 11200?  - 2604?  + 49)x  + 25600?  + 5952?  - 112,
         3        3          2      2           3               2
    (800?  - 14?)x  + (- 400?  + 7)x  + (- 2440?  + 32?)x + 792?  - 16,
          2      4       3        2      2               2
    (- 60?  + 1)x  + 2? x  + (120?  - 3)x  + 26? x + 144?  + 6,
          5    4        3     2               6     4     2
    - 6? x  + x  + 20? x  - 3x  - 10? x + 6, x  - 5x  + 5x  + 4, 0]
Type: PrimitiveArray(UnivariatePolynomial(x,SparseUnivariatePolynomial(Fraction(Integer))))

</pre>
</div>
</div>

<div id="outline-container-org71b9327" class="outline-4">
<h4 id="org71b9327"><span class="section-number-4">1.6.3</span> Example 2.5.2</h4>
<div class="outline-text-4" id="text-1-6-3">
<div class="org-src-container">
<pre class="src src-axiom">f := 36/(x^5 - 2*x^4 - 2*x^3 + 4*x^2 + x - 2);

HermiteIntegrate(f, differentiate)$INTHERTR(F, UUP)

monomialIntegrate(f, differentiate)$INTTR(F, UUP)

integrate univariate(f, x)

integrate(f::EXPR INT, x)
</pre>
</div>

<pre class="example" id="org201df43">
-&gt; f := 36/(x^5 - 2*x^4 - 2*x^3 + 4*x^2 + x - 2);

                    Type: Fraction(UnivariatePolynomial(x,Fraction(Integer)))
-&gt; HermiteIntegrate(f, differentiate)$INTHERTR(F, UUP)

             12x + 6               12
   [answer = ───────,logpart = ──────────,specpart = 0,polypart = 0]
               2                2
              x  - 1           x  - x - 2
Type: Record(answer: Fraction(UnivariatePolynomial(x,Fraction(Integer))),logpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),specpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),polypart: UnivariatePolynomial(x,Fraction(Integer)))
-&gt; monomialIntegrate(f, differentiate)$INTTR(F, UUP)

         12x + 6       ──┐                3          1
   [ir = ─────── +     &gt;         %R log(- ─ %R + x - ─), specpart = 0,
           2           ──┘                8          2
          x  - 1     2
                   %R  - 16 = 0
    polypart = 0]
Type: Record(ir: IntegrationResult(Fraction(UnivariatePolynomial(x,Fraction(Integer)))),specpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),polypart: UnivariatePolynomial(x,Fraction(Integer)))
-&gt; integrate univariate(f, x)

   12? + 6       ──┐                3          1
   ─────── +     &gt;         %A log(- ─ %A + ? - ─)
     2           ──┘                8          2
    ?  - 1     2
             %A  - 16 = 0
Type: IntegrationResult(Fraction(SparseUnivariatePolynomial(Fraction(Polynomial(Fraction(Integer))))))
-&gt; integrate(f::EXPR INT, x)

        2                     2
   (- 4x  + 4)log(x + 1) + (4x  - 4)log(x - 2) + 12x + 6
   ─────────────────────────────────────────────────────
                            2
                           x  - 1
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org697109f" class="outline-3">
<h3 id="org697109f"><span class="section-number-3">1.7</span> 2.6 The Czichowski Algorithm</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-orge54e2ba" class="outline-4">
<h4 id="orge54e2ba"><span class="section-number-4">1.7.1</span> Example 2.6.1</h4>
<div class="outline-text-4" id="text-1-7-1">
<div class="org-src-container">
<pre class="src src-axiom">)clear all
f := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4);
A := numer f; D := denom f;

groebnerFactorize [D, A - t*differentiate D]
</pre>
</div>

<pre class="example" id="org5484128">
-&gt; )clear all
   All user variables and function definitions have been cleared.
-&gt; f := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4);

                                          Type: Fraction(Polynomial(Integer))
-&gt; A := numer f; D := denom f;

                                                    Type: Polynomial(Integer)
-&gt; groebnerFactorize [D, A - t*differentiate D]

          3       2             2
   [[1],[x  + 2t x  - 3x - 4t,4t  + 1]]
                                        Type: List(List(Polynomial(Integer)))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgada3789" class="outline-3">
<h3 id="orgada3789"><span class="section-number-3">1.8</span> 2.7 Newton-Leibniz-Bernoulli Revisited</h3>
<div class="outline-text-3" id="text-1-8">
</div>
<div id="outline-container-org9b34b8e" class="outline-4">
<h4 id="org9b34b8e"><span class="section-number-4">1.8.1</span> Example 2.7.1</h4>
<div class="outline-text-4" id="text-1-8-1">
<div class="org-src-container">
<pre class="src src-axiom">f := 36/(x-2)/(x^2-1)^2
</pre>
</div>

<pre class="example">
-&gt; f := 36/(x-2)/(x^2-1)^2

                36
   ────────────────────────────
    5     4     3     2
   x  - 2x  - 2x  + 4x  + x - 2
                                          Type: Fraction(Polynomial(Integer))

</pre>
</div>
</div>

<div id="outline-container-org09b286f" class="outline-4">
<h4 id="org09b286f"><span class="section-number-4">1.8.2</span> Example 2.7.2</h4>
<div class="outline-text-4" id="text-1-8-2">
<div class="org-src-container">
<pre class="src src-axiom">f1 := univariate(f, x)::FRAC SUP FRAC INT;
fullPartialFraction f1
</pre>
</div>

<pre class="example" id="org15bf8e9">
-&gt; f1 := univariate(f, x)::FRAC SUP FRAC INT;

                Type: Fraction(SparseUnivariatePolynomial(Fraction(Integer)))
-&gt; fullPartialFraction f1

     4       4         ──┐      - 3%I - 6
   ───── - ───── +     &gt;        ─────────
   ? - 2   ? + 1       ──┘              2
                     2          (? - %I)
                   %I  - 1 = 0
Type: FullPartialFractionExpansion(Fraction(Integer),SparseUnivariatePolynomial(Fraction(Integer)))

</pre>
</div>
</div>
