symbolic-integration-1-transcendental-functions-2.org
** 2.8 Rioboo's Algorithm for Real Rational Functions
#+BEGIN_SRC axiom
f := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4)
g := integrate(f, x)
n1 := integrate(f, x=1..2)
n11 := numeric n1
T ==> MakeUnaryCompiledFunction(EXPR INT, FLOAT, FLOAT)
n2 := simpson(compiledFunction(f, x)$T, 1.0, 2.0, 0.1, 0.1, 6, 10)
n11 - n2.value
#+END_SRC

#+RESULTS:
#+begin_example
-> f := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4)

       4     2
      x  - 3x  + 6
   ──────────────────
    6     4     2
   x  - 5x  + 5x  + 4
                                          Type: Fraction(Polynomial(Integer))
-> g := integrate(f, x)

         5     3
        x  - 3x  + x          3
   atan(────────────) + atan(x ) + atan(x)
              2
                                         Type: Union(Expression(Integer),...)
-> n1 := integrate(f, x=1..2)

                                          1
   2atan(8) + 2atan(5) + 2atan(2) + 2atan(─) - %pi
                                          2
   ───────────────────────────────────────────────
                          2
                  Type: Union(f1: OrderedCompletion(Expression(Integer)),...)
-> n11 := numeric n1

   2.8198420991931510451
                                                                  Type: Float
-> T ==> MakeUnaryCompiledFunction(EXPR INT, FLOAT, FLOAT)
                                                                    Type: Void
-> n2 := simpson(compiledFunction(f, x)$T, 1.0, 2.0, 0.1, 0.1, 6, 10)
    Compiling function %N with type Float -> Float

   [value = 2.8198420916463176517, error = 0.14117860771815140533E-6,
    totalpts = 129, success = true]
   Type: Record(value: Float,error: Float,totalpts: Integer,success: Boolean)
-> n11 - n2.value

   0.75468333933E-8
                                                                  Type: Float

#+end_example

#+BEGIN_EXAMPLE
Mathematica

In[1]:= g = Integrate[(x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4),x]
                 2                     2
        x (-3 + x )           x (-3 + x )
-ArcTan[-----------]   ArcTan[-----------]
               2                      2
          2 - x                 -2 + x
-------------------- + -------------------
         2                      2
In[2]:= Simplify[g]
                2
       x (-3 + x )
ArcTan[-----------]
               2
         -2 + x
In[3]:= FullSimplify[g]
              x
ArcTan[x - -------]
                 2
           -2 + x

// ALL 3 ARE NOT CONTINUOUS
#+END_EXAMPLE

*** Algorithm: LogToAtan(A, B)
#+BEGIN_SRC sh :results verbatim :exports both
cd ~/github/fricas
grep -B4 -A15 '^    ilog0(a' src/algebra/irexpand.spad
#+END_SRC

#+RESULTS:
#+begin_example
-- transforms i log((a + i b) / (a - i b)) into a sum of real
-- arc-tangents using Rioboo's algorithm
-- the arc-tangents will not have k in the denominator
-- we always keep upa(k) = a  and upb(k) = b
    ilog0(a, b, upa, upb, k) ==
      if degree(upa) < degree(upb) then
        (upa, upb) := (-upb, upa)
        (a, b) := (-b, a)
      zero? degree upb => tantrick(a, b)
      r := extendedEuclidean(upa, upb)
      (g:= retractIfCan(r.generator)@Union(F,"failed")) case "failed" =>
        tantrick(a, b)
      if degree(r.coef1) >= degree upb then
        qr := divide(r.coef1, upb)
        r.coef1 := qr.remainder
        r.coef2 := r.coef2 + qr.quotient * upa
      aa := (r.coef2) k
      bb := -(r.coef1) k
      tantrick(aa * a + bb * b, g::F) + ilog0(aa, bb, r.coef2, -r.coef1, k)

#+end_example

*** Example 2.8.1
#+BEGIN_SRC axiom
)clear all
R ==> UP(x, FRAC INT); -- SUP doesn't work here
--  because EXPR SUP FRAC INT doesn't make sense, see mailing list
f : FRAC R := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4);
monomialIntegrate(f, differentiate)$INTTR(FRAC INT, R)
res1 := %.ir;
complexExpand res1
expand(res1, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> )clear all
   All user variables and function definitions have been cleared.
-> R ==> UP(x, FRAC INT); -- SUP doesn't work here
                                                                    Type: Void
-> --  because EXPR SUP FRAC INT doesn't make sense, see mailing list
-> f : FRAC R := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4);

                    Type: Fraction(UnivariatePolynomial(x,Fraction(Integer)))
-> monomialIntegrate(f, differentiate)$INTTR(FRAC INT, R)

             ──┐                 2           3
   [ir =     >        %M log((2 x  - 4)%M + x  - 3 x), specpart = 0,
             ──┘
           2   1
         %M  + ─ = 0
               4
    polypart = 0]
Type: Record(ir: IntegrationResult(Fraction(UnivariatePolynomial(x,Fraction(Integer)))),specpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),polypart: UnivariatePolynomial(x,Fraction(Integer)))
-> res1 := %.ir;

 Type: IntegrationResult(Fraction(UnivariatePolynomial(x,Fraction(Integer))))
-> complexExpand res1

     1  ┌───┐      2      ┌───┐    3
     ─ \│- 1 log((x  - 2)\│- 1  + x  - 3 x)
     2
   +
       1  ┌───┐        2      ┌───┐    3
     - ─ \│- 1 log((- x  + 2)\│- 1  + x  - 3 x)
       2
                                          Type: Expression(Fraction(Integer))
-> expand(res1, x)

         1  5   3  3   1            3
   [atan(─ x  - ─ x  + ─ x) + atan(x ) + atan(x)]
         2      2      2
                                    Type: List(Expression(Fraction(Integer)))

#+end_example

Although there is no equivalent algorithm that guarantees the obtention of an
integral with no new poles for more general functions, Rioboo's algorithm has
been used together with rectifying transformations in order to compute integrals
of rational functions in =sin(x)= and =cos(x)=.

** 2.9 In-Field Integration
** Exercises
#+BEGIN_SRC axiom
)clear all
R ==> SUP FRAC INT; x := monomial(1,1)$R;
#+END_SRC

#+RESULTS:
: -> )clear all
:    All user variables and function definitions have been cleared.
: -> R ==> SUP FRAC INT; x := monomial(1,1)$R;
:
:                           Type: SparseUnivariatePolynomial(Fraction(Integer))
:

