symbolic-integration-1-transcendental-functions-2.html

<div id="outline-container-orgc7665f5" class="outline-4">
<h4 id="orgc7665f5"><span class="section-number-4">1.8.3</span> Example 2.7.3</h4>
<div class="outline-text-4" id="text-1-8-3">
<div class="org-src-container">
<pre class="src src-axiom">integrate(f, x)
</pre>
</div>

<pre class="example">
-&gt; integrate(f, x)

        2                     2
   (- 4x  + 4)log(x + 1) + (4x  - 4)log(x - 2) + 12x + 6
   ─────────────────────────────────────────────────────
                            2
                           x  - 1
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org35be5e8" class="outline-3">
<h3 id="org35be5e8"><span class="section-number-3">1.9</span> 2.8 Rioboo's Algorithm for Real Rational Functions</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">
<pre class="src src-axiom">f := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4)
g := integrate(f, x)
n1 := integrate(f, x=1..2)
n11 := numeric n1
T ==&gt; MakeUnaryCompiledFunction(EXPR INT, FLOAT, FLOAT)
n2 := simpson(compiledFunction(f, x)$T, 1.0, 2.0, 0.1, 0.1, 6, 10)
n11 - n2.value
</pre>
</div>

<pre class="example" id="org75e7e0b">
-&gt; f := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4)

       4     2
      x  - 3x  + 6
   ──────────────────
    6     4     2
   x  - 5x  + 5x  + 4
                                          Type: Fraction(Polynomial(Integer))
-&gt; g := integrate(f, x)

         5     3
        x  - 3x  + x          3
   atan(────────────) + atan(x ) + atan(x)
              2
                                         Type: Union(Expression(Integer),...)
-&gt; n1 := integrate(f, x=1..2)

                                          1
   2atan(8) + 2atan(5) + 2atan(2) + 2atan(─) - %pi
                                          2
   ───────────────────────────────────────────────
                          2
                  Type: Union(f1: OrderedCompletion(Expression(Integer)),...)
-&gt; n11 := numeric n1

   2.8198420991931510451
                                                                  Type: Float
-&gt; T ==&gt; MakeUnaryCompiledFunction(EXPR INT, FLOAT, FLOAT)
                                                                    Type: Void
-&gt; n2 := simpson(compiledFunction(f, x)$T, 1.0, 2.0, 0.1, 0.1, 6, 10)
    Compiling function %N with type Float -&gt; Float

   [value = 2.8198420916463176517, error = 0.14117860771815140533E-6,
    totalpts = 129, success = true]
   Type: Record(value: Float,error: Float,totalpts: Integer,success: Boolean)
-&gt; n11 - n2.value

   0.75468333933E-8
                                                                  Type: Float

</pre>

<pre class="example" id="org8622842">
Mathematica

In[1]:= g = Integrate[(x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4),x]
                 2                     2
        x (-3 + x )           x (-3 + x )
-ArcTan[-----------]   ArcTan[-----------]
               2                      2
          2 - x                 -2 + x
-------------------- + -------------------
         2                      2
In[2]:= Simplify[g]
                2
       x (-3 + x )
ArcTan[-----------]
               2
         -2 + x
In[3]:= FullSimplify[g]
              x
ArcTan[x - -------]
                 2
           -2 + x

// ALL 3 ARE NOT CONTINUOUS
</pre>
</div>

<div id="outline-container-org31914f6" class="outline-4">
<h4 id="org31914f6"><span class="section-number-4">1.9.1</span> Algorithm: LogToAtan(A, B)</h4>
<div class="outline-text-4" id="text-1-9-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> /fricas
grep -B4 -A15 <span style="color: #2d9574;">'^    ilog0(a'</span> src/algebra/irexpand.spad
</pre>
</div>

<pre class="example" id="org7e34391">
-- transforms i log((a + i b) / (a - i b)) into a sum of real
-- arc-tangents using Rioboo's algorithm
-- the arc-tangents will not have k in the denominator
-- we always keep upa(k) = a  and upb(k) = b
    ilog0(a, b, upa, upb, k) ==
      if degree(upa) &lt; degree(upb) then
        (upa, upb) := (-upb, upa)
        (a, b) := (-b, a)
      zero? degree upb =&gt; tantrick(a, b)
      r := extendedEuclidean(upa, upb)
      (g:= retractIfCan(r.generator)@Union(F,"failed")) case "failed" =&gt;
        tantrick(a, b)
      if degree(r.coef1) &gt;= degree upb then
        qr := divide(r.coef1, upb)
        r.coef1 := qr.remainder
        r.coef2 := r.coef2 + qr.quotient * upa
      aa := (r.coef2) k
      bb := -(r.coef1) k
      tantrick(aa * a + bb * b, g::F) + ilog0(aa, bb, r.coef2, -r.coef1, k)

</pre>
</div>
</div>

<div id="outline-container-org5d36644" class="outline-4">
<h4 id="org5d36644"><span class="section-number-4">1.9.2</span> Example 2.8.1</h4>
<div class="outline-text-4" id="text-1-9-2">
<div class="org-src-container">
<pre class="src src-axiom">)clear all
R ==&gt; UP(x, FRAC INT); -- SUP doesn't work here
--  because EXPR SUP FRAC INT doesn't make sense, see mailing list
f : FRAC R := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4);
monomialIntegrate(f, differentiate)$INTTR(FRAC INT, R)
res1 := %.ir;
complexExpand res1
expand(res1, x)
</pre>
</div>

<pre class="example" id="org6282987">
-&gt; )clear all
   All user variables and function definitions have been cleared.
-&gt; R ==&gt; UP(x, FRAC INT); -- SUP doesn't work here
                                                                    Type: Void
-&gt; --  because EXPR SUP FRAC INT doesn't make sense, see mailing list
-&gt; f : FRAC R := (x^4 - 3*x^2 + 6)/(x^6 - 5*x^4 + 5*x^2 + 4);

                    Type: Fraction(UnivariatePolynomial(x,Fraction(Integer)))
-&gt; monomialIntegrate(f, differentiate)$INTTR(FRAC INT, R)

             ──┐                 2           3
   [ir =     &gt;        %M log((2 x  - 4)%M + x  - 3 x), specpart = 0,
             ──┘
           2   1
         %M  + ─ = 0
               4
    polypart = 0]
Type: Record(ir: IntegrationResult(Fraction(UnivariatePolynomial(x,Fraction(Integer)))),specpart: Fraction(UnivariatePolynomial(x,Fraction(Integer))),polypart: UnivariatePolynomial(x,Fraction(Integer)))
-&gt; res1 := %.ir;

 Type: IntegrationResult(Fraction(UnivariatePolynomial(x,Fraction(Integer))))
-&gt; complexExpand res1

     1  ┌───┐      2      ┌───┐    3
     ─ \│- 1 log((x  - 2)\│- 1  + x  - 3 x)
     2
   +
       1  ┌───┐        2      ┌───┐    3
     - ─ \│- 1 log((- x  + 2)\│- 1  + x  - 3 x)
       2
                                          Type: Expression(Fraction(Integer))
-&gt; expand(res1, x)

         1  5   3  3   1            3
   [atan(─ x  - ─ x  + ─ x) + atan(x ) + atan(x)]
         2      2      2
                                    Type: List(Expression(Fraction(Integer)))

</pre>

<p>
Although there is no equivalent algorithm that guarantees the obtention of an
integral with no new poles for more general functions, Rioboo's algorithm has
been used together with rectifying transformations in order to compute integrals
of rational functions in <code>sin(x)</code> and <code>cos(x)</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org376c91d" class="outline-3">
<h3 id="org376c91d"><span class="section-number-3">1.10</span> 2.9 In-Field Integration</h3>
</div>
<div id="outline-container-orgc13c8df" class="outline-3">
<h3 id="orgc13c8df"><span class="section-number-3">1.11</span> Exercises</h3>
<div class="outline-text-3" id="text-1-11">
<div class="org-src-container">
<pre class="src src-axiom">)clear all
R ==&gt; SUP FRAC INT; x := monomial(1,1)$R;
</pre>
</div>

<pre class="example">
-&gt; )clear all
   All user variables and function definitions have been cleared.
-&gt; R ==&gt; SUP FRAC INT; x := monomial(1,1)$R;

                          Type: SparseUnivariatePolynomial(Fraction(Integer))

</pre>
</div>
