symbolic-integration-1-transcendental-functions-2.org
*** Exercise 2.1
#+BEGIN_SRC axiom
f := (x^5 - x^4 + 4*x^3 + x^2 - x + 5)/(x^4 - 2*x^3 + 5*x^2 - 4*x + 4)

HermiteIntegrate(f, D)$INTHERTR(FRAC INT, R)

monomialIntegrate(f, D)$INTTR(FRAC INT, R)

integrate(f 'x, 'x)
#+END_SRC

#+RESULTS:
#+begin_example
-> f := (x^5 - x^4 + 4*x^3 + x^2 - x + 5)/(x^4 - 2*x^3 + 5*x^2 - 4*x + 4)

    5    4      3    2
   ?  - ?  + 4 ?  + ?  - ? + 5
   ───────────────────────────
     4      3      2
    ?  - 2 ?  + 5 ?  - 4 ? + 4
                Type: Fraction(SparseUnivariatePolynomial(Fraction(Integer)))
-> HermiteIntegrate(f, D)$INTHERTR(FRAC INT, R)

                4     9                   3
              - ─ ? + ─               ? + ─
                7     7                   7
   [answer = ──────────, logpart = ──────────, specpart = 0, polypart = ? + 1]
              2                     2
             ?  - ? + 2            ?  - ? + 2
Type: Record(answer: Fraction(SparseUnivariatePolynomial(Fraction(Integer))),logpart: Fraction(SparseUnivariatePolynomial(Fraction(Integer))),specpart: Fraction(SparseUnivariatePolynomial(Fraction(Integer))),polypart: SparseUnivariatePolynomial(Fraction(Integer)))
-> monomialIntegrate(f, D)$INTTR(FRAC INT, R)

            4     9
          - ─ ? + ─
            7     7          ──┐                 49          31
   [ir = ────────── +        >            %Y log(── %Y + ? - ──), specpart = 0,
          2                  ──┘                 13          13
         ?  - ? + 2     2        128
                      %Y  - %Y + ─── = 0
                                 343
    polypart = ? + 1]
Type: Record(ir: IntegrationResult(Fraction(SparseUnivariatePolynomial(Fraction(Integer)))),specpart: Fraction(SparseUnivariatePolynomial(Fraction(Integer))),polypart: SparseUnivariatePolynomial(Fraction(Integer)))
-> integrate(f 'x, 'x)

           2             ┌─┐     2
       (7 x  - 7 x + 14)\│7 log(x  - x + 2)
     +
                                         ┌─┐
            2                  (2 x - 1)\│7         4      3              ┌─┐
       (26 x  - 26 x + 52)atan(─────────────) + (7 x  + 7 x  + 20 x + 18)\│7
                                     7
  /
          2              ┌─┐
     (14 x  - 14 x + 28)\│7
                                         Type: Union(Expression(Integer),...)

#+end_example

*** Exercise 2.2
#+BEGIN_SRC axiom :results drawer
f:=(8*x^9+x^8-12*x^7-4*x^6-26*x^5-6*x^4+30*x^3+23*x^2-2*x-7)/(x^10-2*x^8-2*x^7-4*x^6+7*x^4+10*x^3+3*x^2-4*x-2);
monomialIntegrate(f, D)$INTTR(FRAC INT, R)
integrate(f 'x, 'x)
#+END_SRC

#+RESULTS:
:RESULTS:
-> f:=(8*x^9+x^8-12*x^7-4*x^6-26*x^5-6*x^4+30*x^3+23*x^2-2*x-7)/(x^10-2*x^8-2*x^7-4*x^6+7*x^4+10*x^3+3*x^2-4*x-2);

                Type: Fraction(SparseUnivariatePolynomial(Fraction(Integer)))
-> monomialIntegrate(f, D)$INTTR(FRAC INT, R)

   [
       ir
     =
             ──┐
             >        %Y log(- 4 %Y + ?)
             ──┘
           2   1
         %Y  - ─ = 0
               8
       +
                ──┐                       2             4      2
                >            %Y log((- 2 ?  - 2 ?)%Y + ?  + 2 ?  + ? - 1)
                ──┘
           2          1
         %Y  - 2 %Y + ─ = 0
                      2
     ,
    specpart = 0, polypart = 0]
Type: Record(ir: IntegrationResult(Fraction(SparseUnivariatePolynomial(Fraction(Integer)))),specpart: Fraction(SparseUnivariatePolynomial(Fraction(Integer))),polypart: SparseUnivariatePolynomial(Fraction(Integer)))
-> integrate(f 'x, 'x)

             2      ┌─┐
           (x  + 2)\│2  - 4 x
       log(──────────────────)
                  2
                 x  - 2
     +
          ┌─┐     8      5      4      3    2
       2 \│2 log(x  - 2 x  - 4 x  - 4 x  - x  + 2 x + 1)
     +
         2
      *
         log
                      6      5      3      2        ┌─┐    8      5      3
                (- 2 x  - 2 x  + 2 x  + 4 x  + 2 x)\│2  + x  - 2 x  + 4 x
              +
                   2
                3 x  + 2 x + 1
           /
               8      5      4      3    2
              x  - 2 x  - 4 x  - 4 x  - x  + 2 x + 1
  /
        ┌─┐
     2 \│2
                                         Type: Union(Expression(Integer),...)

:END:



*** Exercise 2.3
#+BEGIN_SRC axiom :results drawer
f1 : FRAC SUP INT := (72*x^7+256*x^6-192*x^5-1280*x^4-312*x^3+1440*x^2+576*x-96)/(9*x^8+36*x^7-32*x^6-252*x^5-78*x^4+468*x^3+288*x^2-108*x+9)
f : FRAC R := f1;

monomialIntegrate(f, D)$INTTR(FRAC INT, R)

integrate(f 'x, 'x)

integrate(f 'y, y=-2..(-2/3))
#+END_SRC

#+RESULTS:
:RESULTS:
-> f1 : FRAC SUP INT := (72*x^7+256*x^6-192*x^5-1280*x^4-312*x^3+1440*x^2+576*x-96)/(9*x^8+36*x^7-32*x^6-252*x^5-78*x^4+468*x^3+288*x^2-108*x+9)

        7        6        5         4        3         2
    72 ?  + 256 ?  - 192 ?  - 1280 ?  - 312 ?  + 1440 ?  + 576 ? - 96
   ───────────────────────────────────────────────────────────────────
      8       7       6        5       4        3        2
   9 ?  + 36 ?  - 32 ?  - 252 ?  - 78 ?  + 468 ?  + 288 ?  - 108 ? + 9
                          Type: Fraction(SparseUnivariatePolynomial(Integer))
-> f : FRAC R := f1;

                Type: Fraction(SparseUnivariatePolynomial(Fraction(Integer)))
-> monomialIntegrate(f, D)$INTTR(FRAC INT, R)

                 ──┐                     3             4      2
   [ir =         >            %Y log((2 ?  - 6 ?)%Y + ?  - 4 ?  + 1),
                 ──┘
           2          10
         %Y  - 2 %Y + ── = 0
                       9
    specpart = 0, polypart = 0]
Type: Record(ir: IntegrationResult(Fraction(SparseUnivariatePolynomial(Fraction(Integer)))),specpart: Fraction(SparseUnivariatePolynomial(Fraction(Integer))),polypart: SparseUnivariatePolynomial(Fraction(Integer)))
-> integrate(f 'x, 'x)

         3
      *
              8       7       6        5       4        3        2
       log(9 x  + 36 x  - 32 x  - 252 x  - 78 x  + 468 x  + 288 x  - 108 x + 9)
     +
                 7       6       5        4       3        2
              9 x  + 36 x  - 23 x  - 216 x  - 83 x  + 324 x  + 213 x - 36
       2 atan(───────────────────────────────────────────────────────────)
                                           12
     +
                 5       4      3        2
              9 x  + 36 x  + 4 x  - 108 x  - 53 x + 36
       2 atan(────────────────────────────────────────)
                                 12
     +
                 3       2
              9 x  + 36 x  + 31 x - 18           3 x + 6
       2 atan(────────────────────────) + 2 atan(───────)
                          6                         2
  /
     3
                                         Type: Union(Expression(Integer),...)
-> integrate(f 'y, y=-2..(-2/3))

                           60905           35           38           5639
       - 3 log(97) + 3 log(─────) + 2 atan(──) - 2 atan(──) - 2 atan(────)
                            729             6            9           1458
     +
              17           379                       4
       2 atan(──) + 2 atan(───) + 2 atan(2) + 2 atan(─)
               6           162                       3
  /
     3
                  Type: Union(f1: OrderedCompletion(Expression(Integer)),...)

:END:

