symbolic-integration-1-transcendental-functions-2.html

<div id="outline-container-org5488a99" class="outline-4">
<h4 id="org5488a99"><span class="section-number-4">1.11.1</span> Exercise 2.1</h4>
<div class="outline-text-4" id="text-1-11-1">
<div class="org-src-container">
<pre class="src src-axiom">f := (x^5 - x^4 + 4*x^3 + x^2 - x + 5)/(x^4 - 2*x^3 + 5*x^2 - 4*x + 4)

HermiteIntegrate(f, D)$INTHERTR(FRAC INT, R)

monomialIntegrate(f, D)$INTTR(FRAC INT, R)

integrate(f 'x, 'x)
</pre>
</div>

<pre class="example" id="orgea0203b">
-&gt; f := (x^5 - x^4 + 4*x^3 + x^2 - x + 5)/(x^4 - 2*x^3 + 5*x^2 - 4*x + 4)

    5    4      3    2
   ?  - ?  + 4 ?  + ?  - ? + 5
   ───────────────────────────
     4      3      2
    ?  - 2 ?  + 5 ?  - 4 ? + 4
                Type: Fraction(SparseUnivariatePolynomial(Fraction(Integer)))
-&gt; HermiteIntegrate(f, D)$INTHERTR(FRAC INT, R)

                4     9                   3
              - ─ ? + ─               ? + ─
                7     7                   7
   [answer = ──────────, logpart = ──────────, specpart = 0, polypart = ? + 1]
              2                     2
             ?  - ? + 2            ?  - ? + 2
Type: Record(answer: Fraction(SparseUnivariatePolynomial(Fraction(Integer))),logpart: Fraction(SparseUnivariatePolynomial(Fraction(Integer))),specpart: Fraction(SparseUnivariatePolynomial(Fraction(Integer))),polypart: SparseUnivariatePolynomial(Fraction(Integer)))
-&gt; monomialIntegrate(f, D)$INTTR(FRAC INT, R)

            4     9
          - ─ ? + ─
            7     7          ──┐                 49          31
   [ir = ────────── +        &gt;            %Y log(── %Y + ? - ──), specpart = 0,
          2                  ──┘                 13          13
         ?  - ? + 2     2        128
                      %Y  - %Y + ─── = 0
                                 343
    polypart = ? + 1]
Type: Record(ir: IntegrationResult(Fraction(SparseUnivariatePolynomial(Fraction(Integer)))),specpart: Fraction(SparseUnivariatePolynomial(Fraction(Integer))),polypart: SparseUnivariatePolynomial(Fraction(Integer)))
-&gt; integrate(f 'x, 'x)

           2             ┌─┐     2
       (7 x  - 7 x + 14)\│7 log(x  - x + 2)
     +
                                         ┌─┐
            2                  (2 x - 1)\│7         4      3              ┌─┐
       (26 x  - 26 x + 52)atan(─────────────) + (7 x  + 7 x  + 20 x + 18)\│7
                                     7
  /
          2              ┌─┐
     (14 x  - 14 x + 28)\│7
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>

<div id="outline-container-org7e6a8c9" class="outline-4">
<h4 id="org7e6a8c9"><span class="section-number-4">1.11.2</span> Exercise 2.2</h4>
<div class="outline-text-4" id="text-1-11-2">
<div class="org-src-container">
<pre class="src src-axiom">f:=(8*x^9+x^8-12*x^7-4*x^6-26*x^5-6*x^4+30*x^3+23*x^2-2*x-7)/(x^10-2*x^8-2*x^7-4*x^6+7*x^4+10*x^3+3*x^2-4*x-2);
monomialIntegrate(f, D)$INTTR(FRAC INT, R)
integrate(f 'x, 'x)
</pre>
</div>

<p>
-&gt; f:=(8*x<sup>9</sup>+x<sup>8</sup>-12*x<sup>7</sup>-4*x<sup>6</sup>-26*x<sup>5</sup>-6*x<sup>4</sup>+30*x<sup>3</sup>+23*x<sup>2</sup>-2*x-7)/(x<sup>10</sup>-2*x<sup>8</sup>-2*x<sup>7</sup>-4*x<sup>6</sup>+7*x<sup>4</sup>+10*x<sup>3</sup>+3*x<sup>2</sup>-4*x-2);
</p>

<p>
                Type: Fraction(SparseUnivariatePolynomial(Fraction(Integer)))
-&gt; monomialIntegrate(f, D)$INTTR(FRAC INT, R)
</p>

<p>
[
    ir
  =
          ──┐
          &gt;        %Y log(- 4 %Y + ?)
          ──┘
        2   1
      %Y  - ─ = 0
            8
</p>
<ul class="org-ul">
<li>──┐                       2             4      2
       &gt;            %Y log((- 2 ?  - 2 ?)%Y + ?  + 2 ?  + ? - 1)
       ──┘
  2          1
%Y  - 2 %Y + ─ = 0
             2</li>
</ul>
<p>
     ,
    specpart = 0, polypart = 0]
Type: Record(ir: IntegrationResult(Fraction(SparseUnivariatePolynomial(Fraction(Integer)))),specpart: Fraction(SparseUnivariatePolynomial(Fraction(Integer))),polypart: SparseUnivariatePolynomial(Fraction(Integer)))
-&gt; integrate(f 'x, 'x)
</p>

<p>
      2      ┌─┐
    (x  + 2)\│2  - 4 x
log(──────────────────)
           2
          x  - 2
</p>
<ul class="org-ul">
<li>┌─┐     8      5      4      3    2
2 \│2 log(x  - 2 x  - 4 x  - 4 x  - x  + 2 x + 1)</li>
<li>2
<ul class="org-ul">
<li><p>
log
             6      5      3      2        ┌─┐    8      5      3
       (- 2 x  - 2 x  + 2 x  + 4 x  + 2 x)\│2  + x  - 2 x  + 4 x
</p>
<ul class="org-ul">
<li>2
3 x  + 2 x + 1</li>
</ul>
<p>
/
    8      5      4      3    2
   x  - 2 x  - 4 x  - 4 x  - x  + 2 x + 1
</p></li>
</ul></li>
</ul>
<p>
/
      ┌─┐
   2 \│2
                                       Type: Union(Expression(Integer),&#x2026;)
</p>
</div>
</div>



<div id="outline-container-org87fc506" class="outline-4">
<h4 id="org87fc506"><span class="section-number-4">1.11.3</span> Exercise 2.3</h4>
<div class="outline-text-4" id="text-1-11-3">
<div class="org-src-container">
<pre class="src src-axiom">f1 : FRAC SUP INT := (72*x^7+256*x^6-192*x^5-1280*x^4-312*x^3+1440*x^2+576*x-96)/(9*x^8+36*x^7-32*x^6-252*x^5-78*x^4+468*x^3+288*x^2-108*x+9)
f : FRAC R := f1;

monomialIntegrate(f, D)$INTTR(FRAC INT, R)

integrate(f 'x, 'x)

integrate(f 'y, y=-2..(-2/3))
</pre>
</div>

<p>
-&gt; f1 : FRAC SUP INT := (72*x<sup>7</sup>+256*x<sup>6</sup>-192*x<sup>5</sup>-1280*x<sup>4</sup>-312*x<sup>3</sup>+1440*x<sup>2</sup>+576*x-96)/(9*x<sup>8</sup>+36*x<sup>7</sup>-32*x<sup>6</sup>-252*x<sup>5</sup>-78*x<sup>4</sup>+468*x<sup>3</sup>+288*x<sup>2</sup>-108*x+9)
</p>

<p>
        7        6        5         4        3         2
    72 ?  + 256 ?  - 192 ?  - 1280 ?  - 312 ?  + 1440 ?  + 576 ? - 96
   ───────────────────────────────────────────────────────────────────
      8       7       6        5       4        3        2
   9 ?  + 36 ?  - 32 ?  - 252 ?  - 78 ?  + 468 ?  + 288 ?  - 108 ? + 9
                          Type: Fraction(SparseUnivariatePolynomial(Integer))
-&gt; f : FRAC R := f1;
</p>

<p>
                Type: Fraction(SparseUnivariatePolynomial(Fraction(Integer)))
-&gt; monomialIntegrate(f, D)$INTTR(FRAC INT, R)
</p>

<p>
                 ──┐                     3             4      2
   [ir =         &gt;            %Y log((2 ?  - 6 ?)%Y + ?  - 4 ?  + 1),
                 ──┘
           2          10
         %Y  - 2 %Y + ── = 0
                       9
    specpart = 0, polypart = 0]
Type: Record(ir: IntegrationResult(Fraction(SparseUnivariatePolynomial(Fraction(Integer)))),specpart: Fraction(SparseUnivariatePolynomial(Fraction(Integer))),polypart: SparseUnivariatePolynomial(Fraction(Integer)))
-&gt; integrate(f 'x, 'x)
</p>

<p>
3
</p>
<ul class="org-ul">
<li>8       7       6        5       4        3        2
log(9 x  + 36 x  - 32 x  - 252 x  - 78 x  + 468 x  + 288 x  - 108 x + 9)</li>
</ul>
<ul class="org-ul">
<li>7       6       5        4       3        2
       9 x  + 36 x  - 23 x  - 216 x  - 83 x  + 324 x  + 213 x - 36
2 atan(───────────────────────────────────────────────────────────)
                                    12</li>
<li>5       4      3        2
       9 x  + 36 x  + 4 x  - 108 x  - 53 x + 36
2 atan(────────────────────────────────────────)
                          12</li>
<li>3       2
       9 x  + 36 x  + 31 x - 18           3 x + 6
2 atan(────────────────────────) + 2 atan(───────)
                   6                         2</li>
</ul>
<p>
  /
     3
                                         Type: Union(Expression(Integer),&#x2026;)
-&gt; integrate(f 'y, y=-2..(-2/3))
</p>

<p>
60905           35           38           5639
</p>
<ul class="org-ul">
<li>3 log(97) + 3 log(─────) + 2 atan(──) - 2 atan(──) - 2 atan(────)
729             6            9           1458</li>
</ul>
<ul class="org-ul">
<li>17           379                       4
2 atan(──) + 2 atan(───) + 2 atan(2) + 2 atan(─)
        6           162                       3</li>
</ul>
<p>
/
   3
                Type: Union(f1: OrderedCompletion(Expression(Integer)),&#x2026;)
</p>
</div>
</div>
