symbolic-integration-1-transcendental-functions-2.org
*** Exercise 2.4
#+BEGIN_SRC axiom
)clear all
integrate(1/(1+x^4), x) -- will be shorter in newer fricas
#+END_SRC

#+RESULTS:
#+begin_example
-> )clear all
   All user variables and function definitions have been cleared.
-> integrate(1/(1+x^4), x) -- will be shorter in newer fricas

            ┌─┐                      1
       - 4 \│2 atan(───────────────────────────────────)
                         ┌────────────────┐
                     ┌─┐ │    ┌─┐    2          ┌─┐
                    \│2 \│- x\│2  + x  + 1  + x\│2  - 1
     +
            ┌─┐                     1                     ┌─┐      ┌─┐    2
       - 4 \│2 atan(─────────────────────────────────) + \│2 log(x\│2  + x  + 1)
                         ┌──────────────┐
                     ┌─┐ │  ┌─┐    2          ┌─┐
                    \│2 \│x\│2  + x  + 1  + x\│2  + 1
     +
          ┌─┐        ┌─┐    2
       - \│2 log(- x\│2  + x  + 1)
  /
     8
                                         Type: Union(Expression(Integer),...)

#+end_example

*** Exercise 2.5
See p.51, footnote 4.

#+BEGIN_SRC axiom :eval no
-- fixed between 1.2.7 and 1.3.0.  result too long
integrate((x^4+x^3+x^2+x+1)/(x^5+x^4+2*x^3+2*x^2-2+4*sqrt(-1+sqrt(3))), x)
#+END_SRC

*** Exercise 2.7
This simplification is not in the book, but in the FriCAS source code.

*** Exercise 2.8
#+BEGIN_SRC axiom
integrate(3/(5-4*cos(x)), x)
#+END_SRC

#+RESULTS:
: -> integrate(3/(5-4*cos(x)), x)
:
:           5 cos(x) - 4
:    - atan(────────────)
:             3 sin(x)
:                                          Type: Union(Expression(Integer),...)
:
