symbolic-integration-1-transcendental-functions-2.html

<div id="outline-container-orgb5a2fda" class="outline-4">
<h4 id="orgb5a2fda"><span class="section-number-4">1.11.4</span> Exercise 2.4</h4>
<div class="outline-text-4" id="text-1-11-4">
<div class="org-src-container">
<pre class="src src-axiom">)clear all
integrate(1/(1+x^4), x) -- will be shorter in newer fricas
</pre>
</div>

<pre class="example" id="org83ea6b0">
-&gt; )clear all
   All user variables and function definitions have been cleared.
-&gt; integrate(1/(1+x^4), x) -- will be shorter in newer fricas

            ┌─┐                      1
       - 4 \│2 atan(───────────────────────────────────)
                         ┌────────────────┐
                     ┌─┐ │    ┌─┐    2          ┌─┐
                    \│2 \│- x\│2  + x  + 1  + x\│2  - 1
     +
            ┌─┐                     1                     ┌─┐      ┌─┐    2
       - 4 \│2 atan(─────────────────────────────────) + \│2 log(x\│2  + x  + 1)
                         ┌──────────────┐
                     ┌─┐ │  ┌─┐    2          ┌─┐
                    \│2 \│x\│2  + x  + 1  + x\│2  + 1
     +
          ┌─┐        ┌─┐    2
       - \│2 log(- x\│2  + x  + 1)
  /
     8
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>

<div id="outline-container-orgba1bff9" class="outline-4">
<h4 id="orgba1bff9"><span class="section-number-4">1.11.5</span> Exercise 2.5</h4>
<div class="outline-text-4" id="text-1-11-5">
<p>
See p.51, footnote 4.
</p>

<div class="org-src-container">
<pre class="src src-axiom">-- fixed between 1.2.7 and 1.3.0.  result too long
integrate((x^4+x^3+x^2+x+1)/(x^5+x^4+2*x^3+2*x^2-2+4*sqrt(-1+sqrt(3))), x)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7030c20" class="outline-4">
<h4 id="org7030c20"><span class="section-number-4">1.11.6</span> Exercise 2.7</h4>
<div class="outline-text-4" id="text-1-11-6">
<p>
This simplification is not in the book, but in the FriCAS source code.
</p>
</div>
</div>

<div id="outline-container-orga79ec96" class="outline-4">
<h4 id="orga79ec96"><span class="section-number-4">1.11.7</span> Exercise 2.8</h4>
<div class="outline-text-4" id="text-1-11-7">
<div class="org-src-container">
<pre class="src src-axiom">integrate(3/(5-4*cos(x)), x)
</pre>
</div>

<pre class="example">
-&gt; integrate(3/(5-4*cos(x)), x)

          5 cos(x) - 4
   - atan(────────────)
            3 sin(x)
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-03-25 Thu 17:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>